schemas/src/main/resources/schemas/v1/SetCertificateStatusInteraction/SetCertificateStatusInteraction_1.0_rivtabp20.wsdl

<?xml version="1.0" encoding="UTF-8" ?>
<!-- 
 Licensed to the Apache Software Foundation (ASF) under one
 or more contributor license agreements. See the NOTICE file
 distributed with this work for additional information
 regarding copyright ownership. Sveriges Kommuner och Landsting licenses this file
 to you under the Apache License, Version 2.0 (the
 "License"); you may not use this file except in compliance
 with the License. You may obtain a copy of the License at

 http://www.apache.org/licenses/LICENSE-2.0

 Unless required by applicable law or agreed to in writing,
 software distributed under the License is distributed on an
 "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
 KIND, either express or implied. See the License for the
 specific language governing permissions and limitations
 under the License.
 -->		
<wsdl:definitions name='SetCertificateStatusInteraction' 
  xmlns:wsdl='http://schemas.xmlsoap.org/wsdl/' 
  xmlns:soap='http://schemas.xmlsoap.org/wsdl/soap/' 
  xmlns:xs='http://www.w3.org/2001/XMLSchema'
  xmlns:wsa="http://www.w3.org/2005/08/addressing" 
  xmlns:tjsr='urn:riv:insuranceprocess:healthreporting:SetCertificateStatusResponder:1' 
  xmlns:tns='urn:riv:insuranceprocess:healthreporting:SetCertificateStatus:1:rivtabp20' 
  targetNamespace='urn:riv:insuranceprocess:healthreporting:SetCertificateStatus:1:rivtabp20'>
  
  <xs:annotation>
    <xs:documentation>
      Tjänsteinteraktionens namn: SetCertificateStatusInteraction
      Beskrivning: 
      Set a certificate status
      Revisioner: 
        2013-02-27: Initial version (Mats Ekhammar and Roger Lindsjö, Callista Enterprise AB)
      Tjänstedomän: insuranceprocess:healthreporting
      Tjänsteinteraktionstyp: Fråga-Svar
      WS-profil: RIVTABP20
      Förvaltas av: Sveriges Kommuner och Landsting
    </xs:documentation>
  </xs:annotation>
  
  <wsdl:types>
    <xs:schema targetNamespace='urn:riv:insuranceprocess:healthreporting:SetCertificateStatus:1:rivtabp20'>
      <xs:import schemaLocation='SetCertificateStatusResponder_1.0.xsd' namespace='urn:riv:insuranceprocess:healthreporting:SetCertificateStatusResponder:1' />
      <xs:import schemaLocation='../../core_components/ws-addressing-1.0.xsd' namespace='http://www.w3.org/2005/08/addressing'/>
    </xs:schema>  
  </wsdl:types>
  
  <wsdl:message name='SetCertificateStatusRequest'>
    <wsdl:part name="LogicalAddress" element="wsa:To" >
      <wsdl:documentation>The organisation number of the receiving organisation</wsdl:documentation>
    </wsdl:part>
    <wsdl:part name='parameters' element='tjsr:SetCertificateStatusRequest' />
  </wsdl:message>
  
  <wsdl:message name='SetCertificateStatusResponse'>
    <wsdl:part name='parameters' element='tjsr:SetCertificateStatusResponse' />
  </wsdl:message>
  
  <wsdl:portType name='SetCertificateStatusResponderInterface'>
    <wsdl:operation name='SetCertificateStatus'>
      <wsdl:input message='tns:SetCertificateStatusRequest' />
      <wsdl:output message='tns:SetCertificateStatusResponse' />
    </wsdl:operation>
  </wsdl:portType>
  
  <wsdl:binding name='SetCertificateStatusResponderBinding' type='tns:SetCertificateStatusResponderInterface'>
    <soap:binding style='document' transport='http://schemas.xmlsoap.org/soap/http' />
    <wsdl:operation name='SetCertificateStatus'>
      <soap:operation soapAction='urn:riv:insuranceprocess:healthreporting:SetCertificateStatusResponder:1:SetCertificateStatus' style='document' />
      <wsdl:input>
        <soap:header use='literal' message='tns:SetCertificateStatusRequest' part='LogicalAddress' />
        <soap:body use='literal' parts='parameters' />
      </wsdl:input>
      <wsdl:output>
        <soap:body use='literal' />
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>
  
  <wsdl:service name='SetCertificateStatusResponderService'>
    <wsdl:port name='SetCertificateStatusResponderPort' binding='tns:SetCertificateStatusResponderBinding'>
      <soap:address location='http://tempuri.org' />
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>